recept/src/Documents/ДокументПродажи/ДокументПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДокументПродажи</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.СтоимостьМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.Продано</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьПродажи</registerRecords>
  <registerRecords>InformationRegister.СтатусПродукции</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностьМатериалов</registerRecords>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНакладной</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Покупатели</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозрастКлиента</name>
    <type>
      <types>EnumRef.ВозрастКлиента</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.СтатусыГотовностиПродукции</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/Documents/ДокументПродажи/Forms/ФормаДокумента/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьРодителя(НоменклатураМатериалы) 
// Функция передает в процедуру единицу измерения материала из справочника НоменклатураМатериалы

	Возврат НоменклатураМатериалы.Родитель; 
	                     	
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)   
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПродажи;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПродажиПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПродажи;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Документ.ДокументПродажи.Проведен", Объект.Ссылка, ЭтотОбъект);
	//Проставляет статус товара
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Для Каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		СтрокаТабличнойЧасти.Действие = РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Номенклатура);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	Объект.ВозрастКлиента = РаботаСоСправочниками.ВозрастКлиента(Объект.Контрагент, Объект.Дата);
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Для Каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		СтрокаТабличнойЧасти.Действие = РаботаСоСправочниками.СтатусМатериала(СтрокаТабличнойЧасти.Номенклатура);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	//Для Каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
	//	Если СтрокаТабличнойЧасти.Количество = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура) Тогда  
	//		СтрокаТабличнойЧасти.Действие = ПредопределенноеЗначение("Перечисление.СтатусыГотовностиПродукции.Отгружен");
	//	КонецЕсли;  
	//КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ВозрастКлиента = РаботаСоСправочниками.ВозрастКлиента(Объект.Контрагент, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.ВозрастКлиента = РаботаСоСправочниками.ВозрастКлиента(Объект.Контрагент, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Объект.ВозрастКлиента = РаботаСоСправочниками.ВозрастКлиента(Объект.Контрагент, Объект.Дата);
КонецПроцедуры
